In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "Name": ['Shre','Sriansh', 'Raj','Shivam'],
    "Marks": [23,43,54,55],
    "City": ['Kanpur', 'Mirzapur', 'Delh', 'Juhi']
}

In [3]:
df =  pd.DataFrame(dict1)

In [4]:
df

      Name  Marks      City
0     Shre     23    Kanpur
1  Sriansh     43  Mirzapur
2      Raj     54      Delh
3   Shivam     55      Juhi

In [5]:
df.to_csv('Friends_data.csv')

In [6]:
df.to_csv('Friends_data_No_index.csv', index=False)

In [7]:
df.head(2)

      Name  Marks      City
0     Shre     23    Kanpur
1  Sriansh     43  Mirzapur

In [8]:
df.tail(2)

     Name  Marks  City
2     Raj     54  Delh
3  Shivam     55  Juhi

In [9]:
df.describe()

           Marks
count   4.000000
mean   43.750000
std    14.863266
min    23.000000
25%    38.000000
50%    48.500000
75%    54.250000
max    55.000000

In [10]:
train_Data = pd.read_csv('Tarin_Data.csv')

In [11]:
train_Data

   Train_Number  Speed      City
0         12598    452    Kanpur
1          4520    652  Mirzapur
2          8752    320      Delh
3          9850     65      Juhi

In [12]:
tarin_data = pd.read_csv('Tarin_Data.csv')

In [13]:
tarin_data

   Train_Number  Speed      City
0         12598    452    Kanpur
1          4520    652  Mirzapur
2          8752    320      Delh
3          9850     65      Juhi

In [14]:
train_data[Speed]

NameError: name 'train_data' is not defined

In [ ]:
train_data['speed']

In [ ]:
tarin_data['speed']

In [ ]:
tarin_data['Speed']

In [ ]:
tarin_data['Speed'][0] = 20

In [ ]:
tarin_data

In [ ]:
tarin_data.to_csv('New_Train_data')

In [ ]:
tarin_data.to_csv('New_Train_data.csv')

In [ ]:
tarin_data.info()

In [ ]:
tarin_data.DESCRIBE()

In [ ]:
high_speed = tarin_data[tarin_data['Speed']> 200]
print(high_speed)

In [ ]:
print(tarin_data.describe())

ser = pd.Series(np.random.rand(30))

In [3]:
ser

NameError: name 'ser' is not defined